# coding=utf-8
"""oneingdufs.constants 项目常量

@author MoLice<sf.molice@gmail.com>
|- common_calendar 校历
"""

COMMON_CALENDAR = {
  '2': {
    'details': '2月26日学生报到，2月27日开始上课。',
    '26': '学生报到',
    '27': '正式上课',
  },
  '3': {
    'details': '3月8日下午停课，女教工放假半天。',
    '8': '妇女节，下午停课',
  },
  '4': {
    'details': '2至4日清明节放假调休',
    '2': '2-4日清明节放假',
    '3': '2-4日清明节放假',
    '4': '2-4日清明节放假',
    '29': '4月29至5月1日，五一放假',
    '30': '4月29至5月1日，五一放假',
  },
  '5': {
    'details': '1、4月29至5月1日劳动节放假调休。\n2、5月4日下午停课，组织活动庆祝青年节。\n3、5月7日至11日毕业班考试。',
    '1': '4月29至5月1日，五一放假',
    '4': '五四青年节，下午停课',
    '7': '7-11日毕业班考试',
    '8': '7-11日毕业班考试',
    '9': '7-11日毕业班考试',
    '10': '7-11日毕业班考试',
    '11': '7-11日毕业班考试',
  },
  '6': {
    'details': '1、22至24日端午节放假公休。\n2、第十八周体育课、全人通识教育选修课、通选课、辅修课期末考试。\n3、25至28日研究生、本科生毕业典礼暨学位授予仪式。27至30日办理毕业离校手续。',
    '22': '22-24日，端午节放假',
    '23': '22-24日，端午节放假',
    '24': '22-24日，端午节放假',
  },
  '7': {
    'details': '7月1至13日期末复习考试',
    '14': '2012年7月14日至8月31日放假，9月2日老生报到，3日开始上课，9月9日新生报到',
  },
}
